DATA FRAMES

In [22]:
import numpy as np
import pandas as pd

In [23]:
from numpy.random import randn

In [24]:
np.random.seed(11)

In [25]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [26]:
df

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

TO RETRIEVE A WHOLE COULMN

In [27]:
df['W']

A    1.749455
B   -0.008285
C    0.421051
D    0.689682
E    0.736837
Name: W, dtype: float64

A COULMN OR ROW IN SINGULAR FORMAT IS SERIES AND WHEN THEY BOTH MERGE THEY BECOME DATAFRAMES

In [28]:
type(df['W'])

pandas.core.series.Series

MULTI-COULMN RETRIEVAL

FOR THIS WE PASS LIST OF LIST INSIDE TO RETRIEVE COULMNS

In [29]:
df[['W','X']]

          W         X
A  1.749455 -0.286073
B -0.008285 -0.319631
C  0.421051 -1.065603
D  0.689682  0.561192
E  0.736837  1.574634

CREATION OF A NEW COULMN

WE CAN DO THIS BY USING ARITHEMATIC OPERATIONS

THE NEXT CODE WILL GIVE ERROR

In [30]:
##df['new']

In [31]:
df['new']=df['W']+df['X']

In [32]:
df

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.463382
B -0.008285 -0.319631 -0.536629  0.315403 -0.327916
C  0.421051 -1.065603 -0.886240 -0.475733 -0.644552
D  0.689682  0.561192 -1.305549 -1.119475  1.250874
E  0.736837  1.574634 -0.031075 -0.683447  2.311471

DELETION OF ROWS AND COULMNS

TO TERMINATE ROWS AND COULMNS WE CAN USE .drop() METHOD

THE NEXT CODE WILL ERROR

SINCE BY DEFAULT AXIS=0 WHICH MEANS THE SEGMENT WILL BE SEARCHED IN ROWS

TO ALTER THIS WE NEED TO CHANGE THE axis=1

In [33]:
##df.drop('new')

In [34]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

NOW IF df IS CALLED NO CHANGE WOULD BE VISIBLE SINCE TO PROTECT DATA FROM GETTING LOST

TO MAKE PERMANENT CHANGE WE NEED TO SET inplace=True

In [35]:
df

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.463382
B -0.008285 -0.319631 -0.536629  0.315403 -0.327916
C  0.421051 -1.065603 -0.886240 -0.475733 -0.644552
D  0.689682  0.561192 -1.305549 -1.119475  1.250874
E  0.736837  1.574634 -0.031075 -0.683447  2.311471

In [36]:
df.drop('new',axis=1,inplace=True)

In [37]:
df

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

IF WE WANT TO DROP A ROW THEN BY DEFAULT AXIS IS SET TO 0

In [39]:
df.drop('B')

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

SELECTING ROWS

TO SELECT ROWS WE USE loc[] and iloc[] METHODS

REMEMBER THAT IN loc[] AND iloc[] METHODS SQUARE BRACKETS ARE USED INSTEAD OF PARENTHESIS()

IN loc[] METHOD THE INDEX NAME OF THE ROW IS GIVEN

In [41]:
df.loc['A']

W    1.749455
X   -0.286073
Y   -0.484565
Z   -2.653319
Name: A, dtype: float64

IN iloc[] METHOD NUMERICAL VALUE OF INDEX IS GIVEN

In [42]:
df.iloc[3]

W    0.689682
X    0.561192
Y   -1.305549
Z   -1.119475
Name: D, dtype: float64

SELECTION OF MULTIPLE ROWS

SIMILIAR TO NUMPY WE PASS LIST IN LIST

In [43]:
df.loc[['A','B','E']]

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
E  0.736837  1.574634 -0.031075 -0.683447

IF WE WANT SPECIFIC ROWS ALONG WITH SPECIFIC COULMNS THEN WE PASS BOTH

In [44]:
df.loc[['A','B','E'],['W','X']]

          W         X
A  1.749455 -0.286073
B -0.008285 -0.319631
E  0.736837  1.574634